---
kind: type
id: T:Autodesk.Revit.DB.PlanCircuitSetIterator
source: html/bf994a19-adc3-bf44-dbc0-1e6fa492b8f1.htm
---
# Autodesk.Revit.DB.PlanCircuitSetIterator

An iterator to a set of plan circuit objects.

## Syntax (C#)
```csharp
public abstract class PlanCircuitSetIterator : APIObject,
	IEnumerator
```